trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостояниеОтгрузкиДокумента/СостояниеОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6e2a290-cbc8-4936-bbb2-90e8d1c0db51">
  <name>СостояниеОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="dffce7aa-5f60-4a23-8318-5410c67632ff">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1cc5b099-9bfb-4b1e-8a24-a86abbfec9a4">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4a9099ca-f5d8-4382-a001-2e51e75cdaa1">
    <name>ОценкаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="46ae374e-4820-4eae-9365-1ccc6b8c5430">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d745fd3-8b9f-420d-a661-da3ab7a348d2">
    <name>НомерЗаезда</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="c260e72d-b1f0-4145-ad5d-b7ddd7768010">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f50361ea-5ef2-4f47-b334-48a3a4671d38">
    <name>Филиал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияОтгрузкиДокумента/СостоянияОтгрузкиДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4aae44bd-66b0-4e44-a260-c24e6ec64d86">
  <name>СостоянияОтгрузкиДокумента</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="8e84c8e8-e768-4147-96fc-6d48a0109758">
    <name>ВОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="819c0e3a-7dc1-4053-bee0-2c94c94a81a1">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7cd0e61f-5363-4ced-bdbb-463d617df349">
    <name>Выехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78b7332e-7f20-463b-b919-4c9896d784b6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Процедура ОбновитьСостояниеДокумента(Ссылка) Экспорт  
	
	Если НЕ (Ссылка = Неопределено) Тогда 
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда 
			Если ЗначениеЗаполнено(Ссылка.РабочийУчасток) И Ссылка.РабочийУчасток.ЭлектроннаяОчередь Тогда 
				Структура = Новый Структура; 
				Структура.Вставить("Документ", Ссылка.Накладная); 
				Структура.Вставить("Склад", Ссылка.Склад); 
				Структура.Вставить("Секция", Ссылка.РабочийУчасток);
				Если НЕ ПродажаНаДоставку(Ссылка.Накладная) Тогда  
					ОбновитьЗаписьВРегистре(Структура);	
				КонецЕсли;
			КонецЕсли;    
		Иначе  
			Если НЕ ПродажаНаДоставку(Ссылка) Тогда 
				ОбходСекцийПоДокументу(Ссылка); 
			КонецЕсли;
		КонецЕсли; 	
	КонецЕсли; 	
	
КонецПроцедуры  

&НаСервере
Процедура ОбходСекцийПоДокументу(Ссылка)
	
	ПроверитьИзменениеСклада(Ссылка); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО (ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура)
	|			И (ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|ГДЕ
	|	ТоварыКОтгрузке.Регистратор = &Документ
	|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток.ЭлектроннаяОчередь = Истина"; 
	
	Запрос.УстановитьПараметр("Документ", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура; 
		Структура.Вставить("Документ", Ссылка); 
		Структура.Вставить("Склад", Выборка.Склад); 
		Структура.Вставить("Секция", Выборка.Секция); 
		
		ОбновитьЗаписьВРегистре(Структура);
	КонецЦикла;

КонецПроцедуры 

//Если продажа на доставку или передан не Чек/реализация - возврат истина
&НаСервере
Функция ПродажаНаДоставку(Ссылка) 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	  |	Товары.Ссылка КАК Ссылка,
	  |	Товары.Номенклатура КАК Номенклатура
	  |ИЗ
	  |	Документ.ТАБЛИЦА КАК Товары
	  |ГДЕ
	  |	Товары.Ссылка = &Ссылка
	  |	И (Товары.Номенклатура.Наименование ПОДОБНО ""%достав%""
	  |	ИЛИ Товары.Номенклатура.Наименование ПОДОБНО ""%достав%"")"; 
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос.Текст = СтрЗАменить(Запрос.Текст, "ТАБЛИЦА", "РеализацияТоваровУслуг.Товары"); 
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Запрос.Текст = СтрЗАменить(Запрос.Текст, "ТАБЛИЦА", "ЧекККМ.Товары");
	Иначе
		Возврат Истина; 
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		УдалитьЗаписьВРегистре(Ссылка); 
		Возврат Истина;
	Иначе
		Возврат Ложь; 
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ОбновитьЗаписьВРегистре(Структура) 
	УстановитьПривилегированныйРежим(Истина); 
	Запрос = Новый Запрос;
 	Запрос.Текст =   
	"ВЫБРАТЬ
	|	СостояниеОтгрузки.Документ КАК Документ,
	|	СостояниеОтгрузки.Документ.Номер КАК НомерДокумента,
	|	ВЫРАЗИТЬ(СостояниеОтгрузки.Заказ КАК Документ.ЗаказКлиента).ССайта КАК ССайта,
	|	СостояниеОтгрузки.ОтметкаКассы КАК ОтметкаКассы,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СостояниеОтгрузкиДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтгрузкиДокумента.Заехал)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Заехал,
	|	СостояниеОтгрузки.ЧастичноОтгружен КАК ЧастичноОтгружен,
	|	ВЫБОР
	|		КОГДА СостояниеОтгрузки.Набран = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СостояниеОтгрузки.Набирается = ИСТИНА
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СостояниеОтгрузки.Отгружен = ИСТИНА 
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Выдан)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Состояние,
	|	РасходныйОрдерНаТовары.Статус КАК СтатусОрдера,
	|	СостояниеОтгрузки.Склад КАК Склад,
	|	СостояниеОтгрузки.РабочийУчасток КАК Секция,
	|	ВЫБОР
	|		КОГДА НЕ РасходныйОрдерНаТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА РасходныйОрдерНаТовары.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|						ТОГДА СостояниеОтгрузки.РабочийУчасток
	|					ИНАЧЕ РасходныйОрдерНаТовары.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеОтгрузки.РабочийУчасток
	|	КОНЕЦ КАК ПолучательУведомления,
	|	ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику КАК ТребуетсяОповещениеКладовщику
	|ИЗ
	|	РегистрСведений.СостоянияОтгрузкиНакладных КАК СостояниеОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОтгрузкиДокумента КАК СостояниеОтгрузкиДокумента
	|		ПО СостояниеОтгрузки.Документ = СостояниеОтгрузкиДокумента.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|		ПО СостояниеОтгрузки.Документ = РасходныйОрдерНаТовары.Накладная
	|			И СостояниеОтгрузки.РабочийУчасток = РасходныйОрдерНаТовары.РабочийУчасток
	|			И (РасходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	|		ПО СостояниеОтгрузки.Документ.Ссылка = ЭлектроннаяОчередьКлиентов.Документ.Ссылка
	|ГДЕ
	|	СостояниеОтгрузки.Документ = &Документ 
	|	И СостояниеОтгрузки.Склад = &Склад
	|   И СостояниеОтгрузки.РабочийУчасток = &Секция
	|
	|СГРУППИРОВАТЬ ПО
	|	СостояниеОтгрузки.Документ.Номер,
	|	ВЫРАЗИТЬ(СостояниеОтгрузки.Заказ КАК Документ.ЗаказКлиента).ССайта,
	|	СостояниеОтгрузки.ОтметкаКассы,
	|	ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику,
	|	СостояниеОтгрузки.ЧастичноОтгружен,
	|	СостояниеОтгрузки.Документ,
	|	СостояниеОтгрузки.Склад,
	|	СостояниеОтгрузки.РабочийУчасток,
	|	ВЫБОР
	|		КОГДА СостояниеОтгрузки.Набран = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набран)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СостояниеОтгрузки.Набирается = ИСТИНА
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Набирается)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА СостояниеОтгрузки.Отгружен = ИСТИНА 
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.Выдан)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЭлектроннойОчереди.ОжидаетсяОтбор)
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РасходныйОрдерНаТовары.Статус,
	|	ВЫБОР
	|		КОГДА НЕ РасходныйОрдерНаТовары.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА РасходныйОрдерНаТовары.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|						ТОГДА СостояниеОтгрузки.РабочийУчасток
	|					ИНАЧЕ РасходныйОрдерНаТовары.Сотрудник
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеОтгрузки.РабочийУчасток
	|	КОНЕЦ";
		
	Запрос.УстановитьПараметр("Склад", Структура.Склад);
	Запрос.УстановитьПараметр("Секция", Структура.Секция);
	Запрос.УстановитьПараметр("Документ", Структура.Документ);
	
	Результат = Запрос.Выполнить(); 
	
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Состояние = Перечисления.СтатусыЭлектроннойОчереди.Выдан Тогда  //Если выдан - удаляем такую запись
			УстановитьПривилегированныйРежим(Истина);
			ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
			НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
					 
			НаборЗапись.Отбор.Документ.Установить(Выборка.Документ); 
			НаборЗапись.Отбор.Склад.Установить(Выборка.Склад);
			НаборЗапись.Отбор.Секция.Установить(Выборка.Секция);
			НаборЗапись.Записать();
		   
			УстановитьПривилегированныйРежим(Ложь); 
		Иначе                                                                      //Иначе обновляем ее состояние
				
			ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
			НаборЗаписьЭО = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
			 
			НаборЗаписьЭО.Отбор.Документ.Установить(Выборка.Документ);
			НаборЗаписьЭО.Отбор.Склад.Установить(Выборка.Склад); 
			НаборЗаписьЭО.Отбор.Секция.Установить(Выборка.Секция);
			НаборЗаписьЭО.Прочитать();
			Если НаборЗаписьЭО.Количество() = 0 Тогда
			    ЗаписьЭО = НаборЗаписьЭО.Добавить();
			    ЗаписьЭО.Документ = Выборка.Документ;
			    ЗаписьЭО.Склад = Выборка.Склад; 
				ЗаписьЭО.Секция = Выборка.Секция;
			Иначе
				ЗаписьЭО = НаборЗаписьЭО[0];
			КонецЕсли;
			ЗаписьЭО.СтатусОрдера = Выборка.СтатусОрдера;  
			ЗаписьЭО.НомерДокумента = Выборка.НомерДокумента; 
			ЗаписьЭО.Состояние = Выборка.Состояние;
			ЗаписьЭО.ЧастичноОтгружен = Выборка.ЧастичноОтгружен;
			ЗаписьЭО.Заехал = Выборка.Заехал;
			ЗаписьЭО.ССайта = Выборка.ССайта;
			ЗаписьЭО.ОтметкаКассы = Выборка.ОтметкаКассы;
			ЗаписьЭО.ТребуетсяОповещениеКладовщику = Выборка.ТребуетсяОповещениеКладовщику;
			ЗаписьЭО.ПолучательУведомления = Выборка.ПолучательУведомления;
			
			НаборЗаписьЭО.Записать();  
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь); 


КонецПроцедуры



&НаСервере
Процедура ПроверитьИзменениеСклада(Документ) 
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
					|	ЭлектроннаяОчередьКлиентов.Склад Как Склад
	                |ИЗ
	                |	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов
	                |ГДЕ
	                |	ЭлектроннаяОчередьКлиентов.Документ = &Документ
	                |	И ЭлектроннаяОчередьКлиентов.Документ.Склад <> ЭлектроннаяОчередьКлиентов.Склад"; 
	
    Запрос.УстановитьПараметр("Документ", Документ); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		УстановитьПривилегированныйРежим(Истина);
		ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
		НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
				 
		НаборЗапись.Отбор.Документ.Установить(Документ); 
		НаборЗапись.Отбор.Склад.Установить(Выборка.Склад);
		НаборЗапись.Записать();
	   
		УстановитьПривилегированныйРежим(Ложь); 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьВРегистре(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗапись = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
			 
	НаборЗапись.Отбор.Документ.Установить(Документ);
	НаборЗапись.Записать();
   
	УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

Процедура ПоставитьОтметкуКПП(Ссылка) Экспорт  
	ЭлектроннаяОчередьКлиентов = РегистрыСведений.ЭлектроннаяОчередьКлиентов;
	НаборЗаписьЭО = ЭлектроннаяОчередьКлиентов.СоздатьНаборЗаписей();
	НаборЗаписьЭО.Отбор.Документ.Установить(Ссылка);     
	НаборЗаписьЭО.Прочитать();
	Если НаборЗаписьЭО.Количество() > 0 Тогда    
        ЗаписьЭО = НаборЗаписьЭО[0];
		ЗаписьЭО.Заехал = Истина;    
		НаборЗаписьЭО.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли
